In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('486', '2018-11-21 22:09:04.796', '15', 'paid', None, None, '818', 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('497', '2018-11-21 22:47:16.796', '15', 'paid', None, None, '818', 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('454', '2018-11-21 20:27:58.796', '97', 'paid', None, None, '817', 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 ('498', '2018-11-21 22:51:22.796', '15', 'paid', None, None, '818', 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('153', '2018-11-19 09:45:06.796', '24', 'paid', None, None, '672', 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('80', 'Tegan', 'Levine', 'F', 'paid'),
 ('12', 'Austin', 'Rosales', 'M', 'free'),
 ('73', 'Jacob', 'Klein', 'M', 'paid'),
 ('86', 'Aiden', 'Hess', 'M', 'free'),
 ('83', 'Stefany', 'White', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOXLBJT12A8C140925', 'Caught In A Dream', 'ARYKCQI1187FB3B18F', 2004, Decimal('290.29832')),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, Decimal('189.57016')),
 ('SORAMLE12AB017C8B0', 'Auguri Cha Cha', 'ARHHO3O1187B989413', 0, Decimal('191.84281')),
 ('SOMUYGI12AB0188633', 'La Culpa', 'ARL7K851187B99ACD2', 0, Decimal('226.35057')),
 ('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, Decimal('218.93179'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARB29H41187B98F0EF', 'Terry Callier', 'Chicago', '41.88415', '-87.63241'),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', None, None),
 ('ARXR32B1187FB57099', 'Gob', '', None, None),
 ('ARDNS031187B9924F0', 'Tim Wilson', 'Georgia', '32.67828', '-83.22295'),
 ('ARNNKDK1187B98BBD5', 'Jinx', 'Zagreb Croatia', '45.80726', '15.967600000000001')]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 23, 0, 0), '23', '23', '47', '11', '2018', '4'),
 (datetime.datetime(2018, 11, 30, 0, 0), '19', '30', '48', '11', '2018', '4'),
 (datetime.datetime(2018, 11, 11, 0, 0), '23', '11', '45', '11', '2018', '6'),
 (datetime.datetime(2018, 11, 24, 0, 0), '23', '24', '47', '11', '2018', '5'),
 (datetime.datetime(2018, 11, 20, 0, 0), '22', '20', '47', '11', '2018', '1')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).